# SetPipeSlopes Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeSettings..::..SetPipeSlopes Method
PipeSettings Class See Also
---
Set pipe slope values.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void SetPipeSlopes(
	IList<double> slopes
)
```

Visual Basic
---
```text
Public Sub SetPipeSlopes ( _
	slopes As IList(Of Double) _
)
```

Visual C++
---
```text
public:
void SetPipeSlopes(
	IList<double>^ slopes
)
```

# ### Parameters
slopes
    Type: System.Collections.Generic..::..IList<(Of <(<'Double>)>)> Pipe slope values. Revit stores the slope value as a percentage (0-100).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | Each value of the slopes must be between 0 and 100. Slope value is stored in percentage. e.g. 100 means 100%, and it is 45 degree. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This operation failed. |

# See Also
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace